{
  "name": "decoder",
  "layers": [
    {
      "name": "z_in",
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [
          null,
          8,
          8,
          24
        ],
        "dtype": "float32",
        "sparse": false,
        "name": "z_in"
      },
      "inbound_nodes": []
    },
    {
      "name": "AffineCoupling/li-1/di-00",
      "class_name": "AffineCoupling",
      "config": {
        "name": "AffineCoupling/li-1/di-00",
        "n_ch": 24,
        "hidden_channel_size": 16,
        "bit_per_sub_pixel_factor": 0.0004696272919560428
      },
      "inbound_nodes": [
        [
          [
            "z_in",
            0,
            0,
            {
              "reverse": true
            }
          ]
        ]
      ]
    },
    {
      "name": "Invertible1x1Conv/li-1/di-00",
      "class_name": "Invertible1x1Conv",
      "config": {
        "bit_per_sub_pixel_factor": 0.0004696272919560428,
        "name": "Invertible1x1Conv/li-1/di-00",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "AffineCoupling/li-1/di-00",
            1,
            0,
            {
              "reverse": true
            }
          ]
        ]
      ]
    },
    {
      "name": "ActNorm/li-1/di-00",
      "class_name": "ActNorm",
      "config": {
        "bit_per_sub_pixel_factor": 0.0004696272919560428,
        "name": "ActNorm/li-1/di-00",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "Invertible1x1Conv/li-1/di-00",
            0,
            0,
            {
              "reverse": true
            }
          ]
        ]
      ]
    },
    {
      "name": "Unsqueeze2d/li-1",
      "class_name": "Unsqueeze2d",
      "config": {
        "name": "Unsqueeze2d/li-1",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "ActNorm/li-1/di-00",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "temperature",
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [
          null,
          1
        ],
        "dtype": "float32",
        "sparse": false,
        "name": "temperature"
      },
      "inbound_nodes": []
    },
    {
      "name": "Split2d/li-0",
      "class_name": "Split2d",
      "config": {
        "name": "Split2d/li-0",
        "n_ch": 12,
        "bit_per_sub_pixel_factor": 0.0004696272919560428
      },
      "inbound_nodes": [
        [
          [
            "Unsqueeze2d/li-1",
            0,
            0,
            {
              "reverse": true
            }
          ],
          [
            "temperature",
            0,
            0,
            {
              "reverse": true
            }
          ]
        ]
      ]
    },
    {
      "name": "AffineCoupling/li-0/di-00",
      "class_name": "AffineCoupling",
      "config": {
        "name": "AffineCoupling/li-0/di-00",
        "n_ch": 12,
        "hidden_channel_size": 16,
        "bit_per_sub_pixel_factor": 0.0004696272919560428
      },
      "inbound_nodes": [
        [
          [
            "Split2d/li-0",
            1,
            0,
            {
              "reverse": true
            }
          ]
        ]
      ]
    },
    {
      "name": "Invertible1x1Conv/li-0/di-00",
      "class_name": "Invertible1x1Conv",
      "config": {
        "bit_per_sub_pixel_factor": 0.0004696272919560428,
        "name": "Invertible1x1Conv/li-0/di-00",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "AffineCoupling/li-0/di-00",
            1,
            0,
            {
              "reverse": true
            }
          ]
        ]
      ]
    },
    {
      "name": "ActNorm/li-0/di-00",
      "class_name": "ActNorm",
      "config": {
        "bit_per_sub_pixel_factor": 0.0004696272919560428,
        "name": "ActNorm/li-0/di-00",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "Invertible1x1Conv/li-0/di-00",
            0,
            0,
            {
              "reverse": true
            }
          ]
        ]
      ]
    },
    {
      "name": "Unsqueeze2d/li-0",
      "class_name": "Unsqueeze2d",
      "config": {
        "name": "Unsqueeze2d/li-0",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "ActNorm/li-0/di-00",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "post-process",
      "class_name": "PostProcess",
      "config": {
        "n_bins": 256,
        "name": "post-process",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "Unsqueeze2d/li-0",
            0,
            0,
            {}
          ]
        ]
      ]
    }
  ],
  "input_layers": [
    [
      "z_in",
      0,
      0
    ],
    [
      "temperature",
      0,
      0
    ]
  ],
  "output_layers": [
    [
      "post-process",
      0,
      0
    ]
  ]
}