{
  "name": "encoder",
  "layers": [
    {
      "name": "image",
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [
          null,
          32,
          32,
          3
        ],
        "dtype": "uint8",
        "sparse": false,
        "name": "image"
      },
      "inbound_nodes": []
    },
    {
      "name": "pre-process",
      "class_name": "PreProcess",
      "config": {
        "n_bins": 256,
        "name": "pre-process",
        "trainable": true,
        "dtype": "uint8"
      },
      "inbound_nodes": [
        [
          [
            "image",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "add_random_uniform",
      "class_name": "AddRandomUniform",
      "config": {
        "n_bins": 256,
        "name": "add_random_uniform",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "pre-process",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "Squeeze2d/li-0",
      "class_name": "Squeeze2d",
      "config": {
        "name": "Squeeze2d/li-0",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "add_random_uniform",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "ActNorm/li-0/di-00",
      "class_name": "ActNorm",
      "config": {
        "bit_per_sub_pixel_factor": 0.0004696272919560428,
        "name": "ActNorm/li-0/di-00",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "Squeeze2d/li-0",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "Invertible1x1Conv/li-0/di-00",
      "class_name": "Invertible1x1Conv",
      "config": {
        "bit_per_sub_pixel_factor": 0.0004696272919560428,
        "name": "Invertible1x1Conv/li-0/di-00",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "ActNorm/li-0/di-00",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "AffineCoupling/li-0/di-00",
      "class_name": "AffineCoupling",
      "config": {
        "name": "AffineCoupling/li-0/di-00",
        "n_ch": 12,
        "hidden_channel_size": 16,
        "bit_per_sub_pixel_factor": 0.0004696272919560428
      },
      "inbound_nodes": [
        [
          [
            "Invertible1x1Conv/li-0/di-00",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "Split2d/li-0",
      "class_name": "Split2d",
      "config": {
        "name": "Split2d/li-0",
        "n_ch": 12,
        "bit_per_sub_pixel_factor": 0.0004696272919560428
      },
      "inbound_nodes": [
        [
          [
            "AffineCoupling/li-0/di-00",
            1,
            0,
            {
              "reverse": false
            }
          ]
        ]
      ]
    },
    {
      "name": "Squeeze2d/li-1",
      "class_name": "Squeeze2d",
      "config": {
        "name": "Squeeze2d/li-1",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "Split2d/li-0",
            1,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "ActNorm/li-1/di-00",
      "class_name": "ActNorm",
      "config": {
        "bit_per_sub_pixel_factor": 0.0004696272919560428,
        "name": "ActNorm/li-1/di-00",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "Squeeze2d/li-1",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "Invertible1x1Conv/li-1/di-00",
      "class_name": "Invertible1x1Conv",
      "config": {
        "bit_per_sub_pixel_factor": 0.0004696272919560428,
        "name": "Invertible1x1Conv/li-1/di-00",
        "trainable": true,
        "dtype": "float32"
      },
      "inbound_nodes": [
        [
          [
            "ActNorm/li-1/di-00",
            0,
            0,
            {}
          ]
        ]
      ]
    },
    {
      "name": "AffineCoupling/li-1/di-00",
      "class_name": "AffineCoupling",
      "config": {
        "name": "AffineCoupling/li-1/di-00",
        "n_ch": 24,
        "hidden_channel_size": 16,
        "bit_per_sub_pixel_factor": 0.0004696272919560428
      },
      "inbound_nodes": [
        [
          [
            "Invertible1x1Conv/li-1/di-00",
            0,
            0,
            {}
          ]
        ]
      ]
    }
  ],
  "input_layers": [
    [
      "image",
      0,
      0
    ]
  ],
  "output_layers": [
    [
      "AffineCoupling/li-1/di-00",
      1,
      0
    ]
  ]
}